{
  "added_tokens_decoder": {
    "0": {
      "content": "[PAD]",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "101": {
      "content": "[UNK]",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "102": {
      "content": "[CLS]",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "103": {
      "content": "[SEP]",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "104": {
      "content": "[MASK]",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    }
  },
  "additional_special_tokens": [],
  "clean_up_tokenization_spaces": true,
  "cls_token": "[CLS]",
  "do_basic_tokenize": true,
  "do_lower_case": true,
  "id2label": {
    "0": "a",
    "1": "b",
    "2": "c",
    "3": "d",
    "4": "e",
    "5": "ab",
    "6": "ac",
    "7": "ad",
    "8": "ae",
    "9": "bc",
    "10": "bd",
    "11": "be",
    "12": "cd",
    "13": "ce",
    "14": "de",
    "15": "abc",
    "16": "abd",
    "17": "abe",
    "18": "acd",
    "19": "ace",
    "20": "ade",
    "21": "bcd",
    "22": "bce",
    "23": "bde",
    "24": "cde",
    "25": "abcd",
    "26": "abce",
    "27": "abde",
    "28": "acde",
    "29": "bcde",
    "30": "abcde"
  },
  "label2id": {
    "a": 0,
    "ab": 5,
    "abc": 15,
    "abcd": 25,
    "abcde": 30,
    "abce": 26,
    "abd": 16,
    "abde": 27,
    "abe": 17,
    "ac": 6,
    "acd": 18,
    "acde": 28,
    "ace": 19,
    "ad": 7,
    "ade": 20,
    "ae": 8,
    "b": 1,
    "bc": 9,
    "bcd": 21,
    "bcde": 29,
    "bce": 22,
    "bd": 10,
    "bde": 23,
    "be": 11,
    "c": 2,
    "cd": 12,
    "cde": 24,
    "ce": 13,
    "d": 3,
    "de": 14,
    "e": 4
  },
  "mask_token": "[MASK]",
  "model_max_length": 1000000000000000019884624838656,
  "never_split": null,
  "num_labels": 31,
  "pad_token": "[PAD]",
  "sep_token": "[SEP]",
  "strip_accents": null,
  "tokenize_chinese_chars": true,
  "tokenizer_class": "BertTokenizer",
  "unk_token": "[UNK]"
}
